app/Models/LoginModel.php

    public function getCatData()
    {
        return $this->db->table('categories')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `categories`

    public function getSlider()
    {
        return $this->db->table('slider')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `slider`

    public function saveImage($imagedata)
    {
        return $this->db->table('images')->insert($imagedata);
---
INSERT INTO `images` (`image`, `idProject`) VALUES ('Back Arrow.png', 11)

    public function savePr($data)
    {
        $this->db->table('projects')->insert($data);
---
INSERT INTO `projects` (`projectTitle`, `idCategory`, `projectDescription`) VALUES ('Project 4', '62', 'Project Four')

    public function getCombinedData()
    {
       return $this->db->table('projects')
                  ->select('*')
                  ->join('images', 'images.idProject = projects.id', 'left')
                  ->get()
                  ->getResultArray();
---
SELECT `projects`.*, GROUP_CONCAT(images.image) as images
FROM `projects`
LEFT JOIN `images` ON `images`.`idProject` = `projects`.`id`
GROUP BY `projects`.`id`

    public function delProject($id)
    {
        return $this->db->table('projects')->where('id', $id)->delete();
---
DELETE FROM `projects`
WHERE `id` = '9'